### This codebook combines the various .csv files consisting of predictors (cpi, unemployment, ppi, etc.) into one dataset.
## The goal is to combine the several datasets we have explored that could be useful as predictors into a tidy master dataframe.
### A tidy dataset is a data organization standard where each column is a variable, each row is an observation, and each cell contains a single value
Then will import the dataset into mongodb.

In [1]:
# libraries
import pandas as pd

#!pip install openpyxl
import openpyxl

In [2]:
# libraries
import pandas as pd
import openpyxl

#loading all the datasets
CountyIncome = pd.read_csv('CountyIncome.csv')
midwest_pce = pd.read_csv('MidwestPCE.csv')
midwest_unemployment = pd.read_csv('MidwestUnemployment.csv')
mw_dairy_cpi = pd.read_csv('mw_dairyCPI.csv')
mw_meat_cpi = pd.read_csv('mw_meatCPI.csv')
mw_produce_cpi = pd.read_csv('mw_ProduceCPI.csv')
supermarket_ppi = pd.read_csv('supermarket_ppi.csv')
wholesale_ppi = pd.read_csv('wholesale_ppi.csv')
real_disp_income = pd.read_csv('RealDispIncome.csv')

# Check dims, head, variable meaning, and missing for each df

- CountyIncome.csv

- MidwestPCE.csv

- MidwestUnemployment.csv

- mw_dairyCPI.csv

- mw_meatCPI.csv

- mw_produce_cpi

- RealDispIncome.csv

- supermarket_ppi.csv

- wholesale_ppi.csv

# CountyIncome

In [3]:
CountyIncome.shape # includes all 88 counties in ohio

(88, 4)

In [4]:
CountyIncome.head(10)

   Area FIPS Code  Area Name Employment_Q125 AvgWeeklyWages_Q125
0           39001      Adams           6,917               1,042
1           39003      Allen          49,574               1,166
2           39005    Ashland          18,488                 945
3           39007  Ashtabula          28,589                 946
4           39009     Athens          20,983                 957
5           39011   Auglaize          21,958               1,172
6           39013    Belmont          20,421               1,015
7           39015      Brown           7,995                 839
8           39017     Butler         163,888               1,376
9           39019    Carroll           5,957                 970

**Area FIPS Code**- A standard number that uniquely identifies geographic areas in the United States, such as states and counties

**Area Name**- County name corresponding to the FIPS code

**Employment**- The number of covered employment in that county. According to QCEW concepts, “covered employment” includes workers who are subject to state unemployment insurance laws or the Unemployment Compensation for Federal Employees (UCFE) program.

**Average weekly wages ($)**- The average weekly wage for workers in that county, based on total wages and employment. According to BLS, it's calculated by dividing the total quarterly wages by the average of the three monthly employment levels in the quarter, then dividing by the number of weeks in the quarter.

In [5]:
# renaming the columns to represent the timeframe. Which is quarter1y in 2025
CountyIncome.rename(columns={
    "Employment": "Employment_Q125",
    "Average weekly wages ($)": "AvgWeeklyWages_Q125"
}, inplace=True)

In [6]:
CountyIncome.head()

   Area FIPS Code  Area Name Employment_Q125 AvgWeeklyWages_Q125
0           39001      Adams           6,917               1,042
1           39003      Allen          49,574               1,166
2           39005    Ashland          18,488                 945
3           39007  Ashtabula          28,589                 946
4           39009     Athens          20,983                 957

In [7]:
# Checking missing.
CountyIncome.isnull().sum()

Area FIPS Code         0
Area Name              0
Employment_Q125        0
AvgWeeklyWages_Q125    0
dtype: int64

There's no missing data in the counties income dataset

The county dataset consists of County Employment and Wages in Ohio- in the First Quarter of 2025.
So, how to do I combine this with the other datasets to get a tidy df?

Might have to retreive more of this specific data through the years, and then aggregate date per year/month

In [8]:
# saving dataframe after making changes
CountyIncome.to_csv("CountyIncome.csv", index=False)

# midwest_pce

In [9]:
midwest_pce.shape

(27, 2)

In [10]:
midwest_pce.head(27)

    Year      mw_PCE
0   1998  111170.692
1   1999  118160.617
2   2000  126439.033
3   2001  131410.167
4   2002  135870.358
5   2003  142173.117
6   2004  149701.933
7   2005  157258.717
8   2006  164077.158
9   2007  170780.833
10  2008  175689.950
11  2009  172982.267
12  2010  179225.117
13  2011  186523.650
14  2012  192195.292
15  2013  197343.058
16  2014  204267.367
17  2015  210112.800
18  2016  216620.417
19  2017  224897.517
20  2018  233922.908
21  2019  240008.542
22  2020  235744.858
23  2021  263765.342
24  2022  287537.325
25  2023  303605.758
26  2024  318937.975

In [11]:
# renaming the needed columns to make consistent when combining into mmaster df
midwest_pce.rename(columns={
    "PCE_value": "mw_PCE"}, inplace=True)

In [12]:
midwest_pce.head()

   Year      mw_PCE
0  1998  111170.692
1  1999  118160.617
2  2000  126439.033
3  2001  131410.167
4  2002  135870.358

**mw_PCE**- Mean Personal Consumption Expenditures (PCE) in the midwestern states per year from 1998 to 2024 (in millions of dollars). 

27 years of mean PCE in the midwest from 1998 to 2024, could we get this at the month level?

In [13]:
# saving dataframe after making changes
midwest_pce.to_csv("MidwestPCE.csv", index=False)

# midwest_unemployment

In [14]:
midwest_unemployment.head(20)

    Year Month  Unemployment  Month_Num
0   2000   Jan           3.5          1
1   2000   Feb           3.5          2
2   2000   Mar           3.5          3
3   2000   Apr           3.6          4
4   2000   May           3.6          5
5   2000   Jun           3.6          6
6   2000   Jul           3.7          7
7   2000   Aug           3.7          8
8   2000   Sep           3.7          9
9   2000   Oct           3.7         10
10  2000   Nov           3.8         11
11  2000   Dec           3.9         12
12  2001   Jan           4.0          1
13  2001   Feb           4.1          2
14  2001   Mar           4.2          3
15  2001   Apr           4.2          4
16  2001   May           4.3          5
17  2001   Jun           4.3          6
18  2001   Jul           4.4          7
19  2001   Aug           4.6          8

**Unemployment**- The midwest unemployment rate, measured as the percentage of the civilian labor force that is unemployed, for each month throughout the years.

In [15]:
midwest_unemployment.shape

(312, 4)

In [16]:
# checking the distinct values of years
midwest_unemployment['Year'].value_counts()

Year
2000    12
2001    12
2024    12
2023    12
2022    12
2021    12
2020    12
2019    12
2018    12
2017    12
2016    12
2015    12
2014    12
2013    12
2012    12
2011    12
2010    12
2009    12
2008    12
2007    12
2006    12
2005    12
2004    12
2003    12
2002    12
2025    12
Name: count, dtype: int64

The data contains the Midwest Unemployment from 2000 to the end of 2025.

In [17]:
midwest_unemployment.tail()

     Year Month  Unemployment  Month_Num
307  2025   Aug           4.2          8
308  2025   Sep           NaN          9
309  2025   Oct           NaN         10
310  2025   Nov           NaN         11
311  2025   Dec           NaN         12

Doesn't contain the data from September-December 2025. Which makes sense for Nov-December becuase these months have yet to fully happen/complete. & for Sep-Oct the dates have happened but the data isn't available.

In [18]:
# saving dataframe after making changes
midwest_unemployment.to_csv("MidwestUnemployment.csv", index=False)

# mw_dairy_cpi

In [19]:
mw_dairy_cpi.head(20)

    Year Month  mw_diary_CPI  Month_Num
0   2018   Jan       199.915          1
1   2018   Feb       197.690          2
2   2018   Mar       197.449          3
3   2018   Apr       197.707          4
4   2018   May       196.934          5
5   2018   Jun       197.120          6
6   2018   Jul       197.357          7
7   2018   Aug       194.780          8
8   2018   Sep       195.649          9
9   2018   Oct       193.957         10
10  2018   Nov       189.794         11
11  2018   Dec       191.886         12
12  2019   Jan       192.236          1
13  2019   Feb       193.663          2
14  2019   Mar       195.000          3
15  2019   Apr       194.063          4
16  2019   May       195.331          5
17  2019   Jun       195.142          6
18  2019   Jul       195.282          7
19  2019   Aug       196.724          8

In [20]:
# renaming the needed columns to make consistent when combining into mmaster df
mw_dairy_cpi.rename(columns={
    "CPI": "mw_diary_CPI"}, inplace=True)

In [21]:
mw_dairy_cpi.head()

   Year Month  mw_diary_CPI  Month_Num
0  2018   Jan       199.915          1
1  2018   Feb       197.690          2
2  2018   Mar       197.449          3
3  2018   Apr       197.707          4
4  2018   May       196.934          5

**mw_diary_CPI**- Consumer Price Index for Dairy Products in the Midwest region, per month

In [22]:
mw_dairy_cpi.shape

(96, 4)

In [23]:
# checking the distinct values of years
mw_dairy_cpi['Year'].value_counts()

Year
2018    12
2019    12
2020    12
2021    12
2022    12
2023    12
2024    12
2025    12
Name: count, dtype: int64

8 years of data for the midwest dairy cpi. 2018 thru 2025

In [24]:
mw_dairy_cpi.tail(20)

    Year Month  mw_diary_CPI  Month_Num
76  2024   May       245.021          5
77  2024   Jun       246.668          6
78  2024   Jul       247.328          7
79  2024   Aug       245.066          8
80  2024   Sep       247.211          9
81  2024   Oct       248.622         10
82  2024   Nov       248.624         11
83  2024   Dec       250.550         12
84  2025   Jan       251.144          1
85  2025   Feb       245.643          2
86  2025   Mar       251.048          3
87  2025   Apr       248.091          4
88  2025   May       246.743          5
89  2025   Jun       250.552          6
90  2025   Jul       251.794          7
91  2025   Aug       252.101          8
92  2025   Sep       251.443          9
93  2025   Oct           NaN         10
94  2025   Nov           NaN         11
95  2025   Dec           NaN         12

NA values for oct-dec in 2025 since that data isn't available yet/ hasn't happened.

In [25]:
# saving dataframe after making changes
mw_dairy_cpi.to_csv("mw_dairyCPI.csv", index=False)

# mw_meat_cpi

In [26]:
mw_meat_cpi.head(20)

    Year Month  mw_meat_CPI  Month_Num
0   2018   Jan      247.204          1
1   2018   Feb      246.250          2
2   2018   Mar      246.510          3
3   2018   Apr      250.928          4
4   2018   May      249.071          5
5   2018   Jun      248.070          6
6   2018   Jul      248.927          7
7   2018   Aug      248.286          8
8   2018   Sep      245.319          9
9   2018   Oct      244.750         10
10  2018   Nov      244.133         11
11  2018   Dec      241.678         12
12  2019   Jan      244.643          1
13  2019   Feb      246.053          2
14  2019   Mar      246.636          3
15  2019   Apr      246.965          4
16  2019   May      249.425          5
17  2019   Jun      247.922          6
18  2019   Jul      247.967          7
19  2019   Aug      247.869          8

In [27]:
# renaming the needed columns to make consistent when combining into mmaster df
mw_meat_cpi.rename(columns={
    "CPI_meat": "mw_meat_CPI"}, inplace=True)

In [28]:
mw_meat_cpi.head()

   Year Month  mw_meat_CPI  Month_Num
0  2018   Jan      247.204          1
1  2018   Feb      246.250          2
2  2018   Mar      246.510          3
3  2018   Apr      250.928          4
4  2018   May      249.071          5

**mw_meat_CPI**- Consumer Price Index for Meat Products in the Midwest region, per month

In [29]:
# checking the distinct values of years
mw_meat_cpi['Year'].value_counts()

Year
2018    12
2019    12
2020    12
2021    12
2022    12
2023    12
2024    12
2025    12
Name: count, dtype: int64

In [30]:
mw_meat_cpi.shape

(96, 4)

The dataframes mw_meat_cpi and mw_dairy_cpi have the same shape and include the same years. So will be easy to combine these two dfs.

In [31]:
mw_meat_cpi.tail()

    Year Month  mw_meat_CPI  Month_Num
91  2025   Aug      338.337          8
92  2025   Sep      339.370          9
93  2025   Oct          NaN         10
94  2025   Nov          NaN         11
95  2025   Dec          NaN         12

Same deal, NA values for oct-dec in 2025

In [32]:
# saving dataframe after making changes
mw_meat_cpi.to_csv("mw_meatCPI.csv", index=False)

# mw_produce_cpi

In [33]:
mw_produce_cpi.head()

           ds  Year Month  mw_produce_CPI  Month_Num
0  2015-09-01  2015   Sep         295.811          9
1  2015-10-01  2015   Oct         296.020         10
2  2015-11-01  2015   Nov         298.402         11
3  2015-12-01  2015   Dec         299.334         12
4  2016-01-01  2016   Jan         302.600          1

In [34]:
# renaming the needed columns to make consistent when combining into mmaster df
mw_produce_cpi.rename(columns={
    "CPI_produce": "mw_produce_CPI"}, inplace=True)
mw_produce_cpi.head()

           ds  Year Month  mw_produce_CPI  Month_Num
0  2015-09-01  2015   Sep         295.811          9
1  2015-10-01  2015   Oct         296.020         10
2  2015-11-01  2015   Nov         298.402         11
3  2015-12-01  2015   Dec         299.334         12
4  2016-01-01  2016   Jan         302.600          1

**mw_produce_CPI**- Consumer Price Index for Produce Products in the Midwest region, per month

In [35]:
# checking the distinct values of years
mw_produce_cpi['Year'].value_counts()

Year
2016    12
2017    12
2018    12
2019    12
2020    12
2021    12
2022    12
2023    12
2024    12
2025     9
2015     4
Name: count, dtype: int64

In [36]:
mw_produce_cpi.shape

(121, 5)

In [37]:
mw_produce_cpi.tail()

             ds  Year Month  mw_produce_CPI  Month_Num
116  2025-05-01  2025   May         349.626          5
117  2025-06-01  2025   Jun         352.803          6
118  2025-07-01  2025   Jul         352.790          7
119  2025-08-01  2025   Aug         358.271          8
120  2025-09-01  2025   Sep         358.172          9

we've got last 4 months of 2015, and 2016 through september 2025 in this df. No NA values at the end months for 2025, those months are simply not included in the df, for the same reason that these months are NA in the previoius dfs.

In [38]:
# saving dataframe after making changes
mw_produce_cpi.to_csv("mw_ProduceCPI.csv", index=False)

# supermarket_ppi

In [39]:
supermarket_ppi.head()

           ds  Year Month  mw_supermarket_PPI  Month_Num
0  2015-01-01  2015   Jan               182.4          1
1  2015-02-01  2015   Feb               183.6          2
2  2015-03-01  2015   Mar               180.9          3
3  2015-04-01  2015   Apr               181.4          4
4  2015-05-01  2015   May               186.0          5

In [40]:
# renaming the needed columns to make consistent when combining into mmaster df
supermarket_ppi.rename(columns={
    "PPI_supermarket": "mw_supermarket_PPI"}, inplace=True)
supermarket_ppi.head()

           ds  Year Month  mw_supermarket_PPI  Month_Num
0  2015-01-01  2015   Jan               182.4          1
1  2015-02-01  2015   Feb               183.6          2
2  2015-03-01  2015   Mar               180.9          3
3  2015-04-01  2015   Apr               181.4          4
4  2015-05-01  2015   May               186.0          5

**mw_supermarket_PPI**-  the cost of operating a grocery store/supermarket in the midwest, per month.

In [41]:
# checking the distinct values of years
supermarket_ppi['Year'].value_counts()

Year
2015    12
2016    12
2017    12
2018    12
2019    12
2020    12
2021    12
2022    12
2023    12
2024    12
2025    12
Name: count, dtype: int64

In [42]:
supermarket_ppi.shape

(132, 5)

11 years of supermarket ppi data .complete years from 2015 through 2025

In [43]:
supermarket_ppi.tail()

             ds  Year Month  mw_supermarket_PPI  Month_Num
127  2025-08-01  2025   Aug             283.821          8
128  2025-09-01  2025   Sep                 NaN          9
129  2025-10-01  2025   Oct                 NaN         10
130  2025-11-01  2025   Nov                 NaN         11
131  2025-12-01  2025   Dec                 NaN         12

NA values from spet-dec 2025.

In [44]:
# saving dataframe after making changes
supermarket_ppi.to_csv("supermarket_ppi.csv", index=False)

# wholesale_ppi

In [45]:
wholesale_ppi.head()

           ds  Year Month  mw_wholesale_PPI  Month_Num
0  2015-01-01  2015   Jan              89.9          1
1  2015-02-01  2015   Feb              88.0          2
2  2015-03-01  2015   Mar              87.1          3
3  2015-04-01  2015   Apr              87.0          4
4  2015-05-01  2015   May              88.1          5

In [46]:
# renaming the needed columns to make consistent when combining into mmaster df
wholesale_ppi.rename(columns={
    "PPI_wholesale": "mw_wholesale_PPI"}, inplace=True)
wholesale_ppi.head()

           ds  Year Month  mw_wholesale_PPI  Month_Num
0  2015-01-01  2015   Jan              89.9          1
1  2015-02-01  2015   Feb              88.0          2
2  2015-03-01  2015   Mar              87.1          3
3  2015-04-01  2015   Apr              87.0          4
4  2015-05-01  2015   May              88.1          5

**mw_wholesale_PPI**-  the cost of operating a whaolesaler store in the midwest, per month.

In [47]:
wholesale_ppi.tail()

             ds  Year Month  mw_wholesale_PPI  Month_Num
127  2025-08-01  2025   Aug           156.707          8
128  2025-09-01  2025   Sep               NaN          9
129  2025-10-01  2025   Oct               NaN         10
130  2025-11-01  2025   Nov               NaN         11
131  2025-12-01  2025   Dec               NaN         12

In [48]:
wholesale_ppi.shape

(132, 5)

In [49]:
# checking the distinct values of years
wholesale_ppi['Year'].value_counts()

Year
2015    12
2016    12
2017    12
2018    12
2019    12
2020    12
2021    12
2022    12
2023    12
2024    12
2025    12
Name: count, dtype: int64

wholseale df has same as supermarket_ppi. 11 years of wholesale ppi data. complete years from 2015 through 2025. NA values from spet-dec 2025.

In [50]:
# saving dataframe after making changes
wholesale_ppi.to_csv("wholesale_ppi.csv", index=False)

# real_disp_income

In [51]:
real_disp_income.head()

           ds  Year Month  Month_Num  mw_RealDispIncome
0  2000-01-01  2000   Jan          1             9799.9
1  2000-02-01  2000   Feb          2             9837.9
2  2000-03-01  2000   Mar          3             9864.0
3  2000-04-01  2000   Apr          4             9913.7
4  2000-05-01  2000   May          5             9954.5

In [52]:
real_disp_income.tail()

             ds  Year Month  Month_Num  mw_RealDispIncome
303  2025-04-01  2025   Apr          4            18168.6
304  2025-05-01  2025   May          5            18041.7
305  2025-06-01  2025   Jun          6            18036.2
306  2025-07-01  2025   Jul          7            18077.3
307  2025-08-01  2025   Aug          8            18097.2

In [53]:
# renaming the needed columns to make consistent when combining into mmaster df
real_disp_income.rename(columns={
    "RealDispIncome": "mw_RealDispIncome"}, inplace=True)
real_disp_income.head()

           ds  Year Month  Month_Num  mw_RealDispIncome
0  2000-01-01  2000   Jan          1             9799.9
1  2000-02-01  2000   Feb          2             9837.9
2  2000-03-01  2000   Mar          3             9864.0
3  2000-04-01  2000   Apr          4             9913.7
4  2000-05-01  2000   May          5             9954.5

**mw_RealDispIncome**-  Real disposable personal income. The amount of income an individual or household has left to spend or save after taxes, adjusted for inflation, which meausures average individuals true purchasing power in the U.S. Midwest region, per month

I'm not sure if this definition is correct. but strucutre of df is good to combine

In [54]:
real_disp_income.shape

(308, 5)

In [55]:
308/12

25.666666666666668

In [56]:
# checking the distinct values of years
real_disp_income['Year'].value_counts()

Year
2000    12
2001    12
2024    12
2023    12
2022    12
2021    12
2020    12
2019    12
2018    12
2017    12
2016    12
2015    12
2014    12
2013    12
2012    12
2011    12
2010    12
2009    12
2008    12
2007    12
2006    12
2005    12
2004    12
2003    12
2002    12
2025     8
Name: count, dtype: int64

25 yrs of real disp income. Doensn't include the last 4 months of 2025

In [57]:
# saving dataframe after making changes
real_disp_income.to_csv("RealDispIncome.csv", index=False)

# Combining All these Datasets into a Master Dataset

### The datasets below are in a consistent form where each row is monthly. However, the ranges covered differ in most of these, (I ordered in longer range to shorter range). To combine this I will take the approach of MAking the master df cover the range of the dataset with largest range of values which is so we don't lose that historical data, the datasets that don't have values within this range will have NA values within this range.  .... other approaches could be to only include the ranges of values that we have ----> (Jan 2018 - Sept 2025), but with the approach I am taking we can simply subset the master dataset to get this range that each variable covers.

- MidwestUnemployment.csv (Jan 2000 - Aug 2025)

- RealDispIncome.csv (Jan 2000 - Aug 2025)

- supermarket_ppi.csv (Jan 2015 - Aug 2025)

- wholesale_ppi.csv (Jan 2015 - Aug 2025)

- mw_produce_cpi.csv (Sept 2015 - Sept 2025)

- mw_dairyCPI.csv (Jan 2018 - Sept 2025)

- mw_meatCPI.csv (Jan 2018 - Sept 2025)

### The two following datasets are structured differently from the datasets above. 
#### The MidwestPCE df is is yearly, so the approach I will take to get this df into monthly data is to get sequence the yearly mean over the 12 months of the year to where every month per year has the same PCE value as the annual mean). Lmk if yall think there's a better way to approach this, because we do not have the monthly variation that is correctly representing what happened. Another approach could be to try to find this data into a monthly format rather than yearl. 

- MidwestPCE.csv (1998 - 2024 (Yearly))

#### For the CountyIncome df I am not going to mess with it yet. But I think an approach to get it into monthly data in similar format as the above dfs would be to get as much of the historical data from the bls as we want and replicate the same values across the quarters (Q1 Jan-Mar 2025, etc.). But for now it''ll be separate.

- CountyIncome.csv (Jan 2025 - March 2025 (Q1 in 2025))

In [129]:
import pandas as pd

# Create a monthly date range from Jan 1998 to Sept 2025 (the range of all the dataframes to not throw away any data)
master_index = pd.date_range(start="1998-01-01", end="2025-09-01", freq="MS")
master_df = pd.DataFrame(index=master_index)
master_df.index.name = "Date"

master_df.head()

Empty DataFrame
Columns: []
Index: [1998-01-01 00:00:00, 1998-02-01 00:00:00, 1998-03-01 00:00:00, 1998-04-01 00:00:00, 1998-05-01 00:00:00]

In [130]:
master_df.tail()

Empty DataFrame
Columns: []
Index: [2025-05-01 00:00:00, 2025-06-01 00:00:00, 2025-07-01 00:00:00, 2025-08-01 00:00:00, 2025-09-01 00:00:00]

In [131]:
# add the Year, Month, & Month_Num columns
master_df["Year"] = master_df.index.year
master_df["Month"] = master_df.index.strftime("%b")
master_df["Month_Num"] = master_df.index.month

master_df.head()

            Year Month  Month_Num
Date
1998-01-01  1998   Jan          1
1998-02-01  1998   Feb          2
1998-03-01  1998   Mar          3
1998-04-01  1998   Apr          4
1998-05-01  1998   May          5

Now we have the range of the master dataset.

# Now, need to give some datasets a proper Date column that matches the master Date column & left join them into the master df

# midwest_pce

In [132]:
midwest_pce = pd.read_csv('MidwestPCE.csv')
midwest_pce.head()

   Year      mw_PCE
0  1998  111170.692
1  1999  118160.617
2  2000  126439.033
3  2001  131410.167
4  2002  135870.358

In [133]:
pce_monthly = midwest_pce.reindex(
    pd.date_range("1998-01", "2024-12", freq = "MS"))

pce_monthly['mw_PCE'] = pce_monthly.index.year.map(
    midwest_pce.set_index('Year')['mw_PCE'])

pce_monthly.head()

            Year      mw_PCE
1998-01-01   NaN  111170.692
1998-02-01   NaN  111170.692
1998-03-01   NaN  111170.692
1998-04-01   NaN  111170.692
1998-05-01   NaN  111170.692

Don't care about the NAs in the Year column, just want to left join the mw_PCE column to the Master datatset

In [134]:
pce_monthly = pce_monthly[['mw_PCE']]
master_df = master_df.join(pce_monthly, how = "left")

In [135]:
master_df.nunique()

Year         28
Month        12
Month_Num    12
mw_PCE       27
dtype: int64

# midwest_unemployment

In [136]:
midwest_unemployment = pd.read_csv('MidwestUnemployment.csv')
midwest_unemployment.head()

   Year Month  Unemployment  Month_Num
0  2000   Jan           3.5          1
1  2000   Feb           3.5          2
2  2000   Mar           3.5          3
3  2000   Apr           3.6          4
4  2000   May           3.6          5

In [137]:
# Combine Year and Month into a Date 
midwest_unemployment['Date'] = pd.to_datetime(
    midwest_unemployment['Year'].astype(str) + "-" + midwest_unemployment['Month'] + "-01",
    format="%Y-%b-%d"
)
# Set  Date as index
midwest_unemployment = midwest_unemployment.set_index("Date")

midwest_unemployment.head()

            Year Month  Unemployment  Month_Num
Date
2000-01-01  2000   Jan           3.5          1
2000-02-01  2000   Feb           3.5          2
2000-03-01  2000   Mar           3.5          3
2000-04-01  2000   Apr           3.6          4
2000-05-01  2000   May           3.6          5

Now we have a proper matching date column. Next steps is to keep only the relevant 'Unemployment' column and left join

In [138]:
midwest_unemployment = midwest_unemployment[['Unemployment']]
master_df = master_df.join(midwest_unemployment, how = "left")
master_df.head()

            Year Month  Month_Num      mw_PCE  Unemployment
Date
1998-01-01  1998   Jan          1  111170.692           NaN
1998-02-01  1998   Feb          2  111170.692           NaN
1998-03-01  1998   Mar          3  111170.692           NaN
1998-04-01  1998   Apr          4  111170.692           NaN
1998-05-01  1998   May          5  111170.692           NaN

In [139]:
master_df.head()

            Year Month  Month_Num      mw_PCE  Unemployment
Date
1998-01-01  1998   Jan          1  111170.692           NaN
1998-02-01  1998   Feb          2  111170.692           NaN
1998-03-01  1998   Mar          3  111170.692           NaN
1998-04-01  1998   Apr          4  111170.692           NaN
1998-05-01  1998   May          5  111170.692           NaN

In [140]:
master_df.tail()

            Year Month  Month_Num  mw_PCE  Unemployment
Date
2025-05-01  2025   May          5     NaN           4.2
2025-06-01  2025   Jun          6     NaN           4.2
2025-07-01  2025   Jul          7     NaN           4.2
2025-08-01  2025   Aug          8     NaN           4.2
2025-09-01  2025   Sep          9     NaN           NaN

Unemployment data ranges from Jan 2000 to Aug 2025

# real_disp_income

In [141]:
real_disp_income = pd.read_csv('RealDispIncome.csv')
real_disp_income.head()

           ds  Year Month  Month_Num  mw_RealDispIncome
0  2000-01-01  2000   Jan          1             9799.9
1  2000-02-01  2000   Feb          2             9837.9
2  2000-03-01  2000   Mar          3             9864.0
3  2000-04-01  2000   Apr          4             9913.7
4  2000-05-01  2000   May          5             9954.5

Has a proper Date column just need ti set as index

In [142]:
real_disp_income.columns

Index(['ds', 'Year', 'Month', 'Month_Num', 'mw_RealDispIncome'], dtype='object')

In [143]:
# ds into a DateTime
real_disp_income["ds"] = pd.to_datetime(real_disp_income["ds"])

# Set ds as index
real_disp_income.set_index("ds", inplace=True)
real_disp_income.head()

            Year Month  Month_Num  mw_RealDispIncome
ds
2000-01-01  2000   Jan          1             9799.9
2000-02-01  2000   Feb          2             9837.9
2000-03-01  2000   Mar          3             9864.0
2000-04-01  2000   Apr          4             9913.7
2000-05-01  2000   May          5             9954.5

Now left join real_disp_income to master_df

In [145]:
real_disp_income = real_disp_income[['mw_RealDispIncome']]
master_df = master_df.join(real_disp_income, how = "left")
master_df.head()

            Year Month  Month_Num      mw_PCE  Unemployment  mw_RealDispIncome
Date
1998-01-01  1998   Jan          1  111170.692           NaN                NaN
1998-02-01  1998   Feb          2  111170.692           NaN                NaN
1998-03-01  1998   Mar          3  111170.692           NaN                NaN
1998-04-01  1998   Apr          4  111170.692           NaN                NaN
1998-05-01  1998   May          5  111170.692           NaN                NaN

In [146]:
master_df.tail()

            Year Month  Month_Num  mw_PCE  Unemployment  mw_RealDispIncome
Date
2025-05-01  2025   May          5     NaN           4.2            18041.7
2025-06-01  2025   Jun          6     NaN           4.2            18036.2
2025-07-01  2025   Jul          7     NaN           4.2            18077.3
2025-08-01  2025   Aug          8     NaN           4.2            18097.2
2025-09-01  2025   Sep          9     NaN           NaN                NaN

In [147]:
master_df.nunique()

Year                  28
Month                 12
Month_Num             12
mw_PCE                27
Unemployment          70
mw_RealDispIncome    308
dtype: int64

# wholesale_ppi

In [149]:
wholesale_ppi = pd.read_csv("wholesale_ppi.csv")
wholesale_ppi.head()

           ds  Year Month  mw_wholesale_PPI  Month_Num
0  2015-01-01  2015   Jan              89.9          1
1  2015-02-01  2015   Feb              88.0          2
2  2015-03-01  2015   Mar              87.1          3
3  2015-04-01  2015   Apr              87.0          4
4  2015-05-01  2015   May              88.1          5

same, need to DateTime ds & index it then joing to master_df

In [150]:
# ds into a DateTime
wholesale_ppi["ds"] = pd.to_datetime(wholesale_ppi["ds"])

# Set ds as index
wholesale_ppi.set_index("ds", inplace=True)
wholesale_ppi.head()

            Year Month  mw_wholesale_PPI  Month_Num
ds
2015-01-01  2015   Jan              89.9          1
2015-02-01  2015   Feb              88.0          2
2015-03-01  2015   Mar              87.1          3
2015-04-01  2015   Apr              87.0          4
2015-05-01  2015   May              88.1          5

In [151]:
wholesale_ppi = wholesale_ppi[['mw_wholesale_PPI']]
master_df = master_df.join(wholesale_ppi, how = "left")
master_df.head()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI
Date,,,,,,,
1998-01-01,1998,Jan,1,111170.692,NaN,NaN,NaN
1998-02-01,1998,Feb,2,111170.692,NaN,NaN,NaN
1998-03-01,1998,Mar,3,111170.692,NaN,NaN,NaN
1998-04-01,1998,Apr,4,111170.692,NaN,NaN,NaN
1998-05-01,1998,May,5,111170.692,NaN,NaN,NaN

In [153]:
master_df.tail()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI
Date,,,,,,,
2025-05-01,2025,May,5,NaN,4.2,18041.7,153.744
2025-06-01,2025,Jun,6,NaN,4.2,18036.2,151.869
2025-07-01,2025,Jul,7,NaN,4.2,18077.3,156.889
2025-08-01,2025,Aug,8,NaN,4.2,18097.2,156.707
2025-09-01,2025,Sep,9,NaN,NaN,NaN,NaN

In [152]:
master_df.nunique()

Year                  28
Month                 12
Month_Num             12
mw_PCE                27
Unemployment          70
mw_RealDispIncome    308
mw_wholesale_PPI     109
dtype: int64

# supermarket_ppi

In [154]:
supermarket_ppi = pd.read_csv("supermarket_ppi.csv")
supermarket_ppi.head()

           ds  Year Month  mw_supermarket_PPI  Month_Num
0  2015-01-01  2015   Jan               182.4          1
1  2015-02-01  2015   Feb               183.6          2
2  2015-03-01  2015   Mar               180.9          3
3  2015-04-01  2015   Apr               181.4          4
4  2015-05-01  2015   May               186.0          5

In [155]:
# ds into a DateTime
supermarket_ppi["ds"] = pd.to_datetime(supermarket_ppi["ds"])

# Set ds as index
supermarket_ppi.set_index("ds", inplace=True)
supermarket_ppi.head()

            Year Month  mw_supermarket_PPI  Month_Num
ds
2015-01-01  2015   Jan               182.4          1
2015-02-01  2015   Feb               183.6          2
2015-03-01  2015   Mar               180.9          3
2015-04-01  2015   Apr               181.4          4
2015-05-01  2015   May               186.0          5

In [156]:
supermarket_ppi = supermarket_ppi[['mw_supermarket_PPI']]
master_df = master_df.join(supermarket_ppi, how = "left")
master_df.head()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI
Date,,,,,,,,
1998-01-01,1998,Jan,1,111170.692,NaN,NaN,NaN,NaN
1998-02-01,1998,Feb,2,111170.692,NaN,NaN,NaN,NaN
1998-03-01,1998,Mar,3,111170.692,NaN,NaN,NaN,NaN
1998-04-01,1998,Apr,4,111170.692,NaN,NaN,NaN,NaN
1998-05-01,1998,May,5,111170.692,NaN,NaN,NaN,NaN

In [157]:
master_df.tail()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI
Date,,,,,,,,
2025-05-01,2025,May,5,NaN,4.2,18041.7,153.744,289.379
2025-06-01,2025,Jun,6,NaN,4.2,18036.2,151.869,287.765
2025-07-01,2025,Jul,7,NaN,4.2,18077.3,156.889,285.139
2025-08-01,2025,Aug,8,NaN,4.2,18097.2,156.707,283.821
2025-09-01,2025,Sep,9,NaN,NaN,NaN,NaN,NaN

In [158]:
master_df.nunique()

Year                   28
Month                  12
Month_Num              12
mw_PCE                 27
Unemployment           70
mw_RealDispIncome     308
mw_wholesale_PPI      109
mw_supermarket_PPI    116
dtype: int64

# mw_produce_cpi

In [160]:
mw_produce_cpi = pd.read_csv("mw_ProduceCPI.csv")
mw_produce_cpi.head()

           ds  Year Month  mw_produce_CPI  Month_Num
0  2015-09-01  2015   Sep         295.811          9
1  2015-10-01  2015   Oct         296.020         10
2  2015-11-01  2015   Nov         298.402         11
3  2015-12-01  2015   Dec         299.334         12
4  2016-01-01  2016   Jan         302.600          1

In [161]:
# ds into a DateTime
mw_produce_cpi["ds"] = pd.to_datetime(mw_produce_cpi["ds"])

# Set ds as index
mw_produce_cpi.set_index("ds", inplace=True)
mw_produce_cpi.head()

            Year Month  mw_produce_CPI  Month_Num
ds
2015-09-01  2015   Sep         295.811          9
2015-10-01  2015   Oct         296.020         10
2015-11-01  2015   Nov         298.402         11
2015-12-01  2015   Dec         299.334         12
2016-01-01  2016   Jan         302.600          1

In [162]:
mw_produce_cpi = mw_produce_cpi[['mw_produce_CPI']]
master_df = master_df.join(mw_produce_cpi, how = "left")
master_df.head()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI
Date,,,,,,,,,
1998-01-01,1998,Jan,1,111170.692,NaN,NaN,NaN,NaN,NaN
1998-02-01,1998,Feb,2,111170.692,NaN,NaN,NaN,NaN,NaN
1998-03-01,1998,Mar,3,111170.692,NaN,NaN,NaN,NaN,NaN
1998-04-01,1998,Apr,4,111170.692,NaN,NaN,NaN,NaN,NaN
1998-05-01,1998,May,5,111170.692,NaN,NaN,NaN,NaN,NaN

In [164]:
master_df.tail()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI
Date,,,,,,,,,
2025-05-01,2025,May,5,NaN,4.2,18041.7,153.744,289.379,349.626
2025-06-01,2025,Jun,6,NaN,4.2,18036.2,151.869,287.765,352.803
2025-07-01,2025,Jul,7,NaN,4.2,18077.3,156.889,285.139,352.790
2025-08-01,2025,Aug,8,NaN,4.2,18097.2,156.707,283.821,358.271
2025-09-01,2025,Sep,9,NaN,NaN,NaN,NaN,NaN,358.172

In [165]:
master_df.nunique()

Year                   28
Month                  12
Month_Num              12
mw_PCE                 27
Unemployment           70
mw_RealDispIncome     308
mw_wholesale_PPI      109
mw_supermarket_PPI    116
mw_produce_CPI        121
dtype: int64

# mw_meat_cpi

In [167]:
mw_meat_cpi = pd.read_csv("mw_meatCPI.csv")
mw_meat_cpi.head()

   Year Month  mw_meat_CPI  Month_Num
0  2018   Jan      247.204          1
1  2018   Feb      246.250          2
2  2018   Mar      246.510          3
3  2018   Apr      250.928          4
4  2018   May      249.071          5

create the DateTime

In [168]:
# Combine Year and Month into a Date 
mw_meat_cpi['Date'] = pd.to_datetime(
    mw_meat_cpi['Year'].astype(str) + "-" + mw_meat_cpi['Month'] + "-01",
    format="%Y-%b-%d"
)
# Set  Date as index
mw_meat_cpi = mw_meat_cpi.set_index("Date")

mw_meat_cpi.head()

            Year Month  mw_meat_CPI  Month_Num
Date
2018-01-01  2018   Jan      247.204          1
2018-02-01  2018   Feb      246.250          2
2018-03-01  2018   Mar      246.510          3
2018-04-01  2018   Apr      250.928          4
2018-05-01  2018   May      249.071          5

In [169]:
mw_meat_cpi = mw_meat_cpi[['mw_meat_CPI']]
master_df = master_df.join(mw_meat_cpi, how = "left")
master_df.head()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI,mw_meat_CPI
Date,,,,,,,,,,
1998-01-01,1998,Jan,1,111170.692,NaN,NaN,NaN,NaN,NaN,NaN
1998-02-01,1998,Feb,2,111170.692,NaN,NaN,NaN,NaN,NaN,NaN
1998-03-01,1998,Mar,3,111170.692,NaN,NaN,NaN,NaN,NaN,NaN
1998-04-01,1998,Apr,4,111170.692,NaN,NaN,NaN,NaN,NaN,NaN
1998-05-01,1998,May,5,111170.692,NaN,NaN,NaN,NaN,NaN,NaN

In [171]:
master_df.tail()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI,mw_meat_CPI
Date,,,,,,,,,,
2025-05-01,2025,May,5,NaN,4.2,18041.7,153.744,289.379,349.626,336.031
2025-06-01,2025,Jun,6,NaN,4.2,18036.2,151.869,287.765,352.803,331.587
2025-07-01,2025,Jul,7,NaN,4.2,18077.3,156.889,285.139,352.790,333.221
2025-08-01,2025,Aug,8,NaN,4.2,18097.2,156.707,283.821,358.271,338.337
2025-09-01,2025,Sep,9,NaN,NaN,NaN,NaN,NaN,358.172,339.370

In [170]:
master_df.nunique()

Year                   28
Month                  12
Month_Num              12
mw_PCE                 27
Unemployment           70
mw_RealDispIncome     308
mw_wholesale_PPI      109
mw_supermarket_PPI    116
mw_produce_CPI        121
mw_meat_CPI            93
dtype: int64

# mw_dairy_cpi

In [172]:
mw_dairy_cpi = pd.read_csv("mw_dairyCPI.csv")
mw_dairy_cpi.head()

   Year Month  mw_diary_CPI  Month_Num
0  2018   Jan       199.915          1
1  2018   Feb       197.690          2
2  2018   Mar       197.449          3
3  2018   Apr       197.707          4
4  2018   May       196.934          5

In [173]:
# Combine Year and Month into a Date 
mw_dairy_cpi['Date'] = pd.to_datetime(
    mw_dairy_cpi['Year'].astype(str) + "-" + mw_dairy_cpi['Month'] + "-01",
    format="%Y-%b-%d"
)
# Set  Date as index
mw_dairy_cpi = mw_dairy_cpi.set_index("Date")

mw_dairy_cpi.head()

            Year Month  mw_diary_CPI  Month_Num
Date
2018-01-01  2018   Jan       199.915          1
2018-02-01  2018   Feb       197.690          2
2018-03-01  2018   Mar       197.449          3
2018-04-01  2018   Apr       197.707          4
2018-05-01  2018   May       196.934          5

In [174]:
mw_dairy_cpi = mw_dairy_cpi[['mw_diary_CPI']]
master_df = master_df.join(mw_dairy_cpi, how = "left")
master_df.head()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI,mw_meat_CPI,mw_diary_CPI
Date,,,,,,,,,,,
1998-01-01,1998,Jan,1,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-02-01,1998,Feb,2,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-03-01,1998,Mar,3,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-04-01,1998,Apr,4,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-05-01,1998,May,5,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [176]:
master_df.head()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI,mw_meat_CPI,mw_diary_CPI
Date,,,,,,,,,,,
1998-01-01,1998,Jan,1,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-02-01,1998,Feb,2,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-03-01,1998,Mar,3,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-04-01,1998,Apr,4,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1998-05-01,1998,May,5,111170.692,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [177]:
master_df.tail()

,Year,Month,Month_Num,mw_PCE,Unemployment,mw_RealDispIncome,mw_wholesale_PPI,mw_supermarket_PPI,mw_produce_CPI,mw_meat_CPI,mw_diary_CPI
Date,,,,,,,,,,,
2025-05-01,2025,May,5,NaN,4.2,18041.7,153.744,289.379,349.626,336.031,246.743
2025-06-01,2025,Jun,6,NaN,4.2,18036.2,151.869,287.765,352.803,331.587,250.552
2025-07-01,2025,Jul,7,NaN,4.2,18077.3,156.889,285.139,352.790,333.221,251.794
2025-08-01,2025,Aug,8,NaN,4.2,18097.2,156.707,283.821,358.271,338.337,252.101
2025-09-01,2025,Sep,9,NaN,NaN,NaN,NaN,NaN,358.172,339.370,251.443

In [175]:
master_df.nunique()

Year                   28
Month                  12
Month_Num              12
mw_PCE                 27
Unemployment           70
mw_RealDispIncome     308
mw_wholesale_PPI      109
mw_supermarket_PPI    116
mw_produce_CPI        121
mw_meat_CPI            93
mw_diary_CPI           93
dtype: int64

### Master_df is now complete including the 8 different data sources of Midwest Data explored as of 11-21. PCE, unemployment, RealDisposible Income, Wholesale PPI, Supermarket PPI, Produce PPI, Meat CPI, and Dairy CPI. 
### A row represents monthly data of these variables in the midwest

### There are many NA values as of right especially at the beginning becuase only one variable ranges over the year 1998. But all the variables cover between the years 2018-2024, so we have 6 years of complete time series data within that range as of right now for the master_df.

In [178]:
# saving the master dataframe
master_df.to_csv("Master_df.csv", index=True)